


import Foundation

class SurasViewModel {

  var mockData2: [SuraAndDua] = [
    .init(id: 0,
          dua: [
            Dua(title: "Fotiha surasi",
                arabicText: "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ الرَّحْمَٰنِ الرَّحِيمِ مَالِكِ يَوْمِ الدِّينِ إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ اهْدِنَا الصِّرَاطَ الْمُسْتَقِيمَ صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ",
                transliteration: "Бисмиллаҳир роҳманир роҳим. Алҳамду лиллаҳи роббил ъаламийн. Ар роҳманир роҳийм. Малики явмидийн. Иййака наъбуду ва иййака настаъийн. Иҳдинас сироотол мустақийм. Сироотол лазийна анъамта ъалайҳим ъойрил мағзуби ъалайҳим валаззоооллин.",
                meaning: "Меҳрибон ва раҳмли Аллоҳнинг номи билан! Ҳамд-сано оламларнинг парвардигори – Аллоҳга хосдир. У меҳрибон ва раҳмли зотдир. Жазо (ҳисоб-китоб) кунининг соҳибидир. Фақат Сенгагина ибодат қиламиз ва фақат Сендангина ёрдам сўраймиз. Бизни тўғри йўлга ҳидоят қилгин. Ўзинг неъмат ато этганларнинг йўлига. Ғазабга учраганлар ва адашганлар йўлига эмас."
               ),
            Dua(title: "Оятал курсий",
                arabicText: "اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ ۚ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ ۚ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ مَنْ ذَا الَّذِي يَشْفَعُ عِندَهُ إِلَّا بِإِذْنِهِ ۚ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ۖ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ ۚ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ ۚ وَلَا يَئُودُهُ حِفْظُهُمَا ۚ وَهُوَ الْعَلِيُّ الْعَظِيمُ",
                transliteration: "Аллоҳу лаа илаҳа илла Ҳува ал-Ҳаййул-Қаййум, лаа таъхузуҳу синатув ва лаа навм, лаҳу маа фис-самааваати ва маа фил-арз, ман за-ллазии яшфаъу индаҳу иллаа би изних, йаъламу маа байна айдийҳим ва маа халфаҳум, ва лаа юҳийтууна би шайъим мин ъилмиҳи иллаа бимаа шаа, васиъа курсиййуҳус-самааваати вал-арз, ва лаа йаъудуҳу ҳифзухумаа ва Ҳувал-Алиййул-Азийм.",
                meaning: "Аллоҳ — Ундан ўзга илоҳ йўқ. У — тирик ва барча мавжудотни бошқариб турувчидир. Унга мудроқ ва уйқу орият қилмайди. Осмонлар ва ердаги нарсалар Уникидир. Унинг ҳузурида ҳеч ким Унинг изнисиз шафоат қила олмайди. У уларнинг олдиларини ҳам, орқаларидаги нарсаларни ҳам билади. Унинг илмидан фақат Ўзи хоҳлаганинигина қамраб оладилар. Унинг Курсийси осмонлару ерни ўз ичига олгандир. У икковини муҳофаза қилишдан чарчамайди. Ва У Олий ва Аъзам зотдир."
               ),
            Dua(title: "Kавсар",
                arabicText: "إِنَّا أَعْطَيْنَاكَ الْكَوْثَرَ فَصَلِّ لِرَبِّكَ وَانْحَرْ إِنَّ شَانِئَكَ هُوَ الْأَبْتَرُ",
                transliteration: "Инна аътайнаакал кавсар. Фасалли лироббика ванҳар. Инна шааниака ҳувал абтар.",
                meaning: "Албатта, Биз сенга Кавсарни ато этдик. Бас, Роббинг учун намоз ўқи ва (туя) сўй. Албатта, сенга душманлик қилган (киши)нинг ўзи ҳадиксиз қолгувчидир"
               ),
            Dua(title: "Ихлос сураси",
                arabicText: "قُلْ هُوَ اللَّهُ أَحَدٌ اللَّهُ الصَّمَدُ لَمْ يَلِدْ وَلَمْ يُولَدْ وَلَمْ يَكُن لَّهُ كُفُوًا أَحَدٌ",
                transliteration: "Қул ҳуваллоҳу аҳад. Аллоҳус сомад. Лам ялид ва лам юлад. Ва лам якуллаҳуу куфуван аҳад.",
                meaning: """
Айтинг (Эй Муҳаммад): "У Аллоҳ ягонадир. Аллоҳ бенихоя мустақил ва бехожатдир. У туғмаган ва туғилмаган. Ва Унга ҳеч ким тенг эмас!
"""
               ),
            Dua(title: "Қадр сураси",
                arabicText: "إِنَّا أَنزَلْنَاهُ فِي لَيْلَةِ الْقَدْرِ وَمَا أَدْرَاكَ مَا لَيْلَةُ الْقَدْرِ لَيْلَةُ الْقَدْرِ خَيْرٌ مِّنْ أَلْفِ شَهْرٍ تَنَزَّلُ الْمَلَائِكَةُ وَالرُّوحُ فِيهَا بِإِذْنِ رَبِّهِم مِّن كُلِّ أَمْرٍ سَلَامٌ هِيَ حَتَّىٰ مَطْلَعِ الْفَجْرِ",
                transliteration: "Инна анзалнааҳу фий лайлатил қадр. Ва маа адроока маа лайлатул қадр. Лайлатул қадри хайрум мин алфи шахр. Таназзалул малааикату вар руҳу фийҳа биизни роббиҳим мин кулли амр. Саломун ҳия хатта матлаъил фажр.",
                meaning: "Албатта, Биз Қуръонни Қадр кечасида нозил қилдик. (Эй Муҳаммад), Қадр кечаси нима эканини сиз нима биласиз? Қадр кечаси минг ойдан яхшироқдир. Фаришталар ва Руҳ (Жаброил) унда Роббиларининг изни билан ҳар бир иш учун тушадилар. У (кеча) тонг отгунга қадар тинчликдир!"
               ),
            Dua(title: "Фалақ сураси",
                arabicText: "قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ مِنْ شَرِّ مَا خَلَقَ وَمِنْ شَرِّ غَاسِقٍ إِذَا وَقَبَ وَمِنْ شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ وَمِنْ شَرِّ حَاسِدٍ إِذَا حَسَدَ",
                transliteration: "Қул аъузу би Роббил-фалақ. Мин шарри маа халақ. Ва мин шарри ғоосиқин изаа вақаб. Ва мин шаррин-наффаасати фил-ъуқад. Ва мин шарри ҳасидин изаа ҳасад",
                meaning: "Айтинг (Эй Муҳаммад): Паноҳ тилайман тонг Парвардигоридан. Яратган нарсаларининг ёмонлигидан. Чўкувчи кечанинг ёмонлигидан. Тугунларга пўпуриб сеҳр қилувчиларнинг ёмонлигидан. Ҳасадчи одам ҳасад қилган вақтда унинг ёмонлигидан."
               ),
            Dua(title: "Наас сураси",
                arabicText: "قُلْ أَعُوذُ بِرَبِّ النَّاسِ مَلِكِ النَّاسِ إِلَٰهِ النَّاسِ مِنْ شَرِّ الْوَسْوَاسِ الْخَنَّاسِ الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ مِنَ الْجِنَّةِ وَالنَّاسِ",
                transliteration: "Қул аъузу би Роббин-наас. Маликин-наас. Илааҳин-наас. Мин шаррил-васваасил-ханнаас. Аллазий ювасвису фий судуурин-наас. Минал-жиннати ван-наас.",
                meaning: "Айтинг (Эй Муҳаммад): Паноҳ тилайман одамларнинг Роббидан. Одамларнинг Подшоҳидан. Одамларнинг Илоҳидан. Яшириниб туриб васваса қилувчининг ёмонлигидан. Кишиларнинг кўксларига васваса солувчининг ёмонлигидан. У (васваса қилувчи) жинлар ва одамлардан бўлади."
               )
          ]),
    .init(id: 1,
          dua: [
            Dua(
              title: "Ramazon oyida o‘qiladigan duo",
              arabicText: "اللَّهُمَّ بَارِكْ لَنَا فِي رَمَضَانَ، وَأَعِنَّا عَلَى صِيَامِهِ وَقِيَامِهِ، وَتَقَبَّلْهُ مِنَّا",
              transliteration: "Allohumma barik lana fi Ramadana, wa a‘inna ‘ala siyamihi wa qiyamihi, wa taqabbalhu minna.",
              meaning: "Ey Alloh! Bizga Ramazon oyini barakali qilgin, uning ro‘zasini va namozlarini ado etishda bizga yordam ber va uni bizdan qabul qil!"
            ),
            Dua(
              title: "Laylatul Qadr (Qadr kechasi) Duosi",
              arabicText: "اللَّهُمَّ إِنَّكَ عَفُوٌّ تُحِبُّ العَفْوَ فَاعْفُ عَنِّي",
              transliteration: "Allohumma innaka ‘afuwwun tuhibbul ‘afwa fa‘fu anni.",
              meaning: "Ey Alloh! Sen kechirimlisanku, kechirishni sevasanku, meni ham kechirgin!"
            )
          ]),
    .init(id: 2,
          dua: [
            Dua(
              title: "Рўза тутиш (саҳарлик, оғиз ёпиш) дуоси",
              arabicText: "نويت أن أصوم شهر رمضان من الفجر إلى غروب الشمس في سبيل الله.",
              transliteration: "Навайту ан асувма совма шаҳри рамазона минал фажри илал мағриби, холисан лиллаҳи таъаалаа Аллоҳу акбар.",
              meaning: "Маъноси: Рамазон ойининг рўзасини субҳдан то кун ботгунча тутмоқни ният қилдим. Холис Аллоҳ учун Аллоҳ буюкдир."
            )
          ]),
    .init(id: 3,
          dua: [
            Dua(
              title: "Ифторлик (оғиз очиш) дуоси",
              arabicText: "اللَّهُمَّ لَكَ صُمْتُ وَبِكَ آمَنْتُ وَعَلَيْكَ تَوَكَّلْتُ وَعَلَى رِزْقِكَ أَفْطَرْتُ فَاغْفِرْ لِي مَا قَدَّمْتُ وَمَا أَخَّرْتُ",
              transliteration: "Аллоҳумма лака сумту ва бика ааманту ва аълайка таваккалту ва аълаа ризқика афтарту, фағфирлий ма қоддамту ва маа аххорту бироҳматика йаа арҳамар рооҳимийн.",
              meaning: "Маъноси: Эй Аллоҳ, ушбу Рўзамни Сен учун тутдим ва Сенга иймон келтирдим ва Сенга таваккал қилдим ва берган ризқинг билан ифтор қилдим. Эй меҳрибонларнинг энг меҳрибони, менинг аввалги ва кейинги гуноҳларимни мағфират қилгил."
            )
          ]),
    .init(id: 4,
          dua: [
            Dua(title: "Ла ҳавла ва ла қуввата илла биллаҳ",
                arabicText: "لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ",
                transliteration: "",
                meaning: "Куч-қудрат фақат Аллоҳ билангина!"
               ),
            Dua(title: "Ла илаҳа иллаллоҳу ваҳдаҳу ла шарика лаҳу",
                arabicText: "لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ",
                transliteration: "",
                meaning: "Аллоҳдан ўзга илоҳ йўқ, У яккаю ягона, Унга ҳеч қандай шерик йўқ!"
               ),
            Dua(title: "Субҳаналлоҳи ва бихамдиҳи, субҳаналлоҳил ъазийм",
                arabicText: "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ، سُبْحَانَ اللَّهِ الْعَظِيمِ",
                transliteration: "",
                meaning: "Аллоҳ нуқсонлардан пок ва Улуғдир!")
          ]),
    .init(id: 5,
          dua: [
            Dua(title: "Астағфируллоҳ",
                arabicText: "أَسْتَغْفِرُ اللَّهَ",
                transliteration: "",
                meaning: "Аллоҳдан мағфират сўрайман!"
               ),
            Dua(title: "Астағфируллоҳал ъазийм",
                arabicText: "أَسْتَغْفِرُ اللَّهَ الْعَظِيمَ",
                transliteration: "",
                meaning: "Мен буюк Аллоҳдан мағфират сўрайман!"
               ),
            Dua(title: "Родиту биллаҳи роббан, ва бил-ислами динан, ва би Муҳаммадин ﷺ набиййан",
                arabicText: "رَضِيتُ بِاللَّهِ رَبًّا، وَبِالْإِسْلَامِ دِينًا، وَبِمُحَمَّدٍ ﷺ نَبِيًّا",
                transliteration: "",
                meaning: "Мен Аллоҳни Робб деб рози бўлдим, Исломни дин деб рози бўлдим, Муҳаммад (соллаллоҳу алайҳи васаллам)ни пайғамбар деб рози бўлдим!"
               )
          ])
  ]
}
