


import Foundation

struct Dua {
  let title: String      // Name of dua
  let arabicText: String // Arabic name of dua
  let transliteration: String // Reading formation
  let meaning: String    // Meaning

  static func mockData() -> [Dua] {
return [
  .init(title: "Рўза тутиш (саҳарлик, оғиз ёпиш) дуоси",
  arabicText: "نويت أن أصوم شهر رمضان من الفجر إلى غروب الشمس في سبيل الله.",
  transliteration: "Навайту ан асувма совма шаҳри рамазона минал фажри илал мағриби, холисан лиллаҳи таъаалаа Аллоҳу акбар.",
  meaning: "Маъноси: Рамазон ойининг рўзасини субҳдан то кун ботгунча тутмоқни ният қилдим. Холис Аллоҳ учун Аллоҳ буюкдир."
       ),
  .init(title: "Ифторлик (оғиз очиш) дуоси",
        arabicText: "اللَّهُمَّ لَكَ صُمْتُ وَبِكَ آمَنْتُ وَعَلَيْكَ تَوَكَّلْتُ وَعَلَى رِزْقِكَ أَفْطَرْتُ فَاغْفِرْ لِي مَا قَدَّمْتُ وَمَا أَخَّرْتُ",
        transliteration: "Аллоҳумма лака сумту ва бика ааманту ва аълайка таваккалту ва аълаа ризқика афтарту, фағфирлий ма қоддамту ва маа аххорту бироҳматика йаа арҳамар рооҳимийн.",
        meaning: "Маъноси: Эй Аллоҳ, ушбу Рўзамни Сен учун тутдим ва Сенга иймон келтирдим ва Сенга таваккал қилдим ва берган ризқинг билан ифтор қилдим. Эй меҳрибонларнинг энг меҳрибони, менинг аввалги ва кейинги гуноҳларимни мағфират қилгил."
       )
]
  }
}
